# Требуется вычислить, сколько раз встречается некоторое число k в массиве list_1.

# Найдите количество и выведите его.

# Пример:
# list_1 = [1, 2, 3, 4, 5]
# k = 3
# 1
# Моё решение первой задачи:


list_1 = [1, 2, 3, 4, 5, 3, 3]
k = 6
count_k = 0
for i in list_1:
    if i == k:
        count_k += 1
print(count_k)




# Требуется найти в массиве list_1 самый близкий по величине элемент к заданному числу k и вывести его.

# Пример:
# list_1 = [1, 2, 3, 4, 5]
# k = 6
# # 5
# Моё первое решение задачи:

list_1 = [1, 2, 3, 4, 5,]
k = 6
for i in range(len(list_1)):
    if list_1[i] < k:
        nearest_num = -k
    else:
        nearest_num = nearest_num + 0
    if list_1[i] >= k and list_1[i] - k <= nearest_num - k:
        nearest_num = list_1[i]
    elif list_1[i] <= k and nearest_num - k <= list_1[i] - k:
        nearest_num = list_1[i]
print(nearest_num)




# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# А русские буквы оцениваются так:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова k и выводит его. 
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.
# Пример:
# k = 'ноутбук'
# 12


import re
def Scrabble(text):
	return bool(re.search("[а-яА-Я]", text))
Rus = { 1:"А, В, Е, И, Н, О, Р, С, Т",
      	2:"Д, К, Л, М, П, У",
        3:"Б, Г, Ё, Ь, Я",
        4:"Й, Ы",
        5:"Ж, З, Х, Ц, Ч",
        8:"Ш, Э, Ю",
        10:"Ф, Щ, Ъ"}
Eng = { 1:"A, E, I, O, U, L, N, S, T, R ",
        2:"D, G",
        3:"B, C, M, P",
        4:"F, H, V, W, Y",
        5:"K",
        8:"J, X"}
text = input("Введите слово: ").upper()
if Scrabble(text):
	print(sum([k for i in text for k, v in Rus.items() if i in v]))
else:
	print(sum([k for i in text for k, v in Eng.items() if i in v]))